#HangMan_The_Game
import random

stages = ['''
  +---+
  |   |
  O   |
 /|\  |
 / \  |
      |
=========
''', '''
  +---+
  |   |
  O   |
 /|\  |
 /    |
      |
=========
''', '''

  +---+
  |   |
  O   |
 /|\  |
      |
      |
=========
''',
          '''
  +---+
  |   |
  O   |
 /|   |
      |
      |
=========
''',
          '''
  +---+
  |   |
  O   |
  |   |
      |
      |
=========
''',
          '''
  +---+
  |   |
  O   |
      |
      |
      |
=========
''',
          '''
  +---+
  |   |
      |
      |
      |
      |
=========

''']

lives = 7
end_of_game = False
word_list = ["кант", "хроника", "зал", "галера", "балл", "вес", "кафель", "знак",
"фильтр", "башня", "кондитер", "омар", "чан", "пламя", "банк", "тетерев", "муж",
"камбала", "груз", "кино", "лаваш", "калач", "геолог", "бальзам", "бревно", "жердь",
"борец", "самовар", "карабин", "подлокотник", "барак", "мотор", "шарж", "сустав",
"амфитеатр", "скворечник", "подлодка", "затычка", "ресница", "спичка", "кабан",
"муфта", "синоптик", "характер", "мафиози", "фундамент", "бумажник", "библиофил",
"дрожжи", "казино", "конечность", "пробор", "дуст", "комбинация", "мешковина",
"процессор", "крышка", "сфинкс", "пассатижи", "фунт", "кружево", "агитатор", "формуляр",
"прокол", "абзац", "караван", "леденец", "кашпо", "баркас", "кардан", "вращение",
"заливное", "метрдотель", "клавиатура", "радиатор", "сегмент", "обещание", "магнитофон",
"кордебалет", "заварушка"]



chosen_word = random.choice(word_list)





display = []
word_length = len(chosen_word)
for _ in range(word_length):
    display += "_"
print(display)



while not end_of_game:
    user_guess = input("Угадай букву: ").lower()



    for position in range(word_length):
        letter = chosen_word[position]
        if letter == user_guess:
            display[position] = letter


    if user_guess not in chosen_word:
        print(stages[lives - 1])
        lives -= 1
        if lives < 1:
            end_of_game = True
            print("Game Over")
            print(chosen_word)



    print(display)

    if "_" not in display:
        end_of_game = True
        print("You win!")
